Repository: gitter-badger/php_nml
Catalog: Locale/*.po
Languages: es

source: Property do not exists
es: La propiedad no existe

source: Property is write only
es: La propiedad es de sólo escritura

source: Unable to access to '%s' property in '%s' class. Reason: %s
es: No se puede acesar a la propiedad '%s' en la clase '%s'. Razón: %s

source: Property is read only
es: La propiedad es de sólo lectura

source: Unable to assign '%s' property in '%s' class. Reason: %s
es: No se puede asignar la propiedad '%s' en la clase '%s'. Razón: %s

source: Using default %s method. You can replace its behavior, overriding it by creating %s::ToString() public method.
es: Usando el método %s predeterminado. Puedes reemplazar su comportambiento, sobreescribiéndolo, creando el método público %s::ToString().

source: You implemented IEquatable interface, but using default Object::Equals() method. You must override it, creating %s::Equals() public method.
es: Haz implementado la interfaz IEquatable, pero se está usando el método predeterminado Object::Equals(). Debes sobreescribirlo creando el método público %s::Equals().

source: To get the name, use Type::Name property instead.
es: Para obtener el nombre, usa la propiedad Type::Name más bien.

source: To get vars, use Type::Vars property instead.
es: Para obtener las variables, usa la propiedad Type::Vars más bien.

source: To get methods, use Type::Methods property instead.
es: Para obtener los métodos, usa la propiedad Type::Methods más bien.

source: Can not specify $versions argument if $name argument is null.
es: No se puede especificar el argumento $versions si el argumento $name es null.

source: Asset has not versions.
es: Recurso no tiene versiones definidas.

source: Asset has not version %s.
es: Recurso no tiene definida la versión %s.

source: %5$s failed. Expected: (%3$s) "%4$s". Actual: (%1$s) "%2$s".
es: %5$s ha fallado. Se esperaba: (%3$s) "%4$s". Real: (%1$s) "%2$s".

source: Message: %s
es: Mensaje: %s

source: %5$s failed. Not expected: (%3$s) "%4$s". Actual: (%1$s) "%2$s".
es: %5$s ha fallado. No se esperaba: (%3$s) "%4$s". Real: (%1$s) "%2$s".

source: %1$s failed. Expected: "%2$s". Actual: "%3$s".
es: %1$s ha fallado. Se esperaba: "%2$s". Real: "%3$s".

source: Invalid argument type. '%s' (argument %s) must be an instance of '%s', '%s' given. Convert value or use the static method Version::Parse(string|mixed) to create a new instance from an string.
es: Tipo inválido de argumento. '%s' (argumento %s) debe ser una instancia de '%s', '%s' given. Convierte el valor o usa el método estático Version::Parse(string|mixed) para crear una nueva instancia de una cadena.

source: Invalid argument value. '%s' (argument %s) must be a positive number; '%s' given.
es: Valor inválido de argumento. '%s' (argumento %s) debe ser un número positivo; '%s' dado.

source: Unable to parse. Argument passed has an invalid format: '%s'.
es: No se puede convertir. El argumento que se ha pasado tiene un formato inválido '%s'.

source: Invalid argument value. "%s" (argument %s) must be positive; "%s" given.
es: Valor inválido de argumento. "%s" (argumento %s) debe ser positivo; se dio "%s".

source: Invalid argument value. "%s" (argument %s) has invalid chars: "%s".
es: Valor inválido de argumento. "%s" (argumento %s) tiene caracteres inválidos: "%s".
